# внутрішній_каталог_додатку/management/commands/fill_users.py
#Після цього ви зможете викликати цю команду з терміналу, використовуючи python manage.py fill_db, і вона виконає ваш код

from django.core.management.base import BaseCommand
from django.utils import timezone
from random import choice, randint

from django.contrib.auth.models import User
from dashboard.models import Todo

todo_list = [
    "Прибрати кімнату",
    "Помити посуд",
    "Приготувати сніданок",
    "Пошити вдень",
    "Прочитати книгу",
    "Відвідати спортивний зал",
    "Зробити покупки у супермаркеті",
    "Відвести собаку на прогулянку",
    "Відвідати магазин одягу",
    "Приготувати обід",
    "Зануритися у новий хобі",
    "Посадити кімнатні рослини",
    "Провести час з друзями",
    "Подивитися новий фільм або серіал",
    "Відвідати музей або галерею",
    "Навчитися новій мові",
    "Вивчити новий рецепт",
    "Виготовити подарунок для друга",
    "Скласти план подорожі",
    "Провести час на природі",
    "Вивчити новий музичний інструмент",
    "Провести ревізію гардеробу",
    "Почати щоденник",
    "Провести час з родиною",
    "Відвідати новий ресторан",
    "Вивчити основи програмування",
    "Відвідати концерт або виставу",
    "Пограти в настільні ігри",
    "Провести вечірку з друзями",
    "Здійснити покупки для свята",
    "Відвідати місцевий ринок",
    "Вивчити новий спосіб розслабитися",
    "Провести час на воді",
    "Зареєструватися на курси",
    "Зробити декор для дому",
    "Вивчити нову техніку фотографії",
    "Провести час у кав'ярні",
    "Посадити квіти у саду",
    "Відвідати театральний виступ",
    "Поспілкуватися зі старим другом",
    "Приготувати вечерю разом з кимось",
    "Вивчити нову роботу в мистецтві",
    "Провести час у бібліотеці",
    "Переглянути старі фотографії",
    "Вивчити основи йоги",
    "Провести час на велосипеді",
    "Зробити вибірку музики для плейлисту",
    "Пограти в інтерактивну гру",
    "Провести час у басейні",
    "Спланувати наступну відпустку"]


class Command(BaseCommand):
    help = 'Заповнення таблиці Todo за допомогою Django ORM'  #python manage.py fill_db --help - виклик допомоги

    def handle(self, *args, **kwargs):
        time = timezone.now().strftime('%X')
        self.stdout.write("It's now %s" % time)

        #беремо всі завдання
        users = User.objects.all()

        for u in users:
            todo = Todo.objects.create(user=u, title=choice(todo_list), is_finished=False)
            todo.save()
            todo = Todo.objects.create(user=u, title=choice(todo_list), is_finished=True)
            todo.save()

        self.stdout.write(self.style.SUCCESS('Таблицю Todo успішно заповнено'))
